configuration/src/InformationRegisters/DataAreasExchangeTransportSettings/DataAreasExchangeTransportSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DataAreasExchangeTransportSettings</name>
  <comment>Stores settings for the transport of exchange messages that are common to all data areas.</comment>
  <resources>
    <name>FILEDataExchangeDirectory</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>FILECompressOutgoingMessageFile</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPCompressOutgoingMessageFile</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionMaxMessageSize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionPassiveConnection</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionPort</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionPath</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>DefaultExchangeMessagesTransportKind</name>
    <type>
      <types>EnumRef.ExchangeMessagesTransportTypes</types>
    </type>
  </resources>
  <resources>
    <name>DeleteFTPConnectionPassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>DeleteExchangeMessageArchivePassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>CorrespondentEndpoint</name>
    <type>
      <types>DefinedType.MessagesQueueEndpoint</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/DataAreaExchangeTransportSettings/DataAreaExchangeTransportSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DataAreaExchangeTransportSettings</name>
  <comment>Stores private exchange message transport settings for each data area.</comment>
  <resources>
    <name>CorrespondentEndpoint</name>
    <type>
      <types>DefinedType.MessagesQueueEndpoint</types>
    </type>
  </resources>
  <resources>
    <name>DataExchangeDirectory</name>
    <comment>Relative path to the exchange directory on the server or on the local network.</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Peer</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ExchangeMessagesTransportTypes/ExchangeMessagesTransportTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExchangeMessagesTransportTypes</name>
  <enumValues>
    <name>EMAIL</name>
  </enumValues>
  <enumValues>
    <name>FILE</name>
  </enumValues>
  <enumValues>
    <name>FTP</name>
  </enumValues>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>COM</name>
  </enumValues>
  <enumValues>
    <name>WSPassiveMode</name>
  </enumValues>
  <enumValues>
    <name>ExternalSystem</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/DataAreasExchangeTransportSettings/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

// Updates a register record by the passed structure values
//
Procedure UpdateRecord(RecordStructure) Export
	
	DataExchangeInternal.UpdateInformationRegisterRecord(RecordStructure, "DataAreasExchangeTransportSettings");
	
EndProcedure

Function TransportSettings(Val CorrespondentEndpoint) Export
	
	QueryText =
	"SELECT
	|	TransportSettings.FILEDataExchangeDirectory AS FILEDataExchangeDirectory,
	|	TransportSettings.FILECompressOutgoingMessageFile AS FILECompressOutgoingMessageFile,
	|	TransportSettings.FTPCompressOutgoingMessageFile AS FTPCompressOutgoingMessageFile,
	|	TransportSettings.FTPConnectionMaxMessageSize AS FTPConnectionMaxMessageSize,
	|	TransportSettings.FTPConnectionPassiveConnection AS FTPConnectionPassiveConnection,
	|	TransportSettings.FTPConnectionUser AS FTPConnectionUser,
	|	TransportSettings.FTPConnectionPort AS FTPConnectionPort,
	|	TransportSettings.FTPConnectionPath AS FTPConnectionPath,
	|	TransportSettings.DefaultExchangeMessagesTransportKind AS DefaultExchangeMessagesTransportKind
	|FROM
	|	InformationRegister.DataAreasExchangeTransportSettings AS TransportSettings
	|WHERE
	|	TransportSettings.CorrespondentEndpoint = &CorrespondentEndpoint";
	
	Query = New Query;
	Query.SetParameter("CorrespondentEndpoint", CorrespondentEndpoint);
	Query.Text = QueryText;
	
	QueryResult = Query.Execute();
	
	If QueryResult.IsEmpty() Then
		Raise StrTemplate(NStr("en = 'Connection settings for the endpoint %1 are not set.';"),
			String(CorrespondentEndpoint));
	EndIf;
	
	Result = DataExchangeInternal.QueryResultToStructure(QueryResult);
	SetPrivilegedMode(True);
	Passwords = Common.ReadDataFromSecureStorage(
		CorrespondentEndpoint, "FTPConnectionDataAreasPassword,ArchivePasswordDataAreaExchangeMessages", True);
	SetPrivilegedMode(False);
	Result.Insert("ArchivePasswordExchangeMessages", Passwords.ArchivePasswordDataAreaExchangeMessages);
	Result.Insert("FTPConnectionPassword", Passwords.FTPConnectionDataAreasPassword);
	
	If Result.DefaultExchangeMessagesTransportKind = Enums.ExchangeMessagesTransportTypes.FTP Then
		
		FTPParameters = DataExchangeServer.FTPServerNameAndPath(Result.FTPConnectionPath);
		
		Result.Insert("FTPServer", FTPParameters.Server);
		Result.Insert("FTPPath",   FTPParameters.Path);
	Else
		Result.Insert("FTPServer", "");
		Result.Insert("FTPPath",   "");
	EndIf;
	
	DataExchangeServer.AddTransactionItemsCountToTransportSettings(Result);
	
	Return Result;
	
EndFunction

Function DefaultExchangeMessagesTransportKind(Peer) Export
	
	MessagesTransportKind = Undefined;
	
	Query = New Query(
	"SELECT
	|	DataAreasTransportSettings.DefaultExchangeMessagesTransportKind AS DefaultExchangeMessagesTransportKind
	|FROM
	|	InformationRegister.DataAreaExchangeTransportSettings AS DataAreaTransportSettings
	|		INNER JOIN InformationRegister.DataAreasExchangeTransportSettings AS DataAreasTransportSettings
	|		ON (DataAreasTransportSettings.CorrespondentEndpoint = DataAreaTransportSettings.CorrespondentEndpoint)
	|WHERE
	|	DataAreaTransportSettings.Peer = &Peer");
	Query.SetParameter("Peer", Peer);

	Selection = Query.Execute().Select();
	If Selection.Next() Then
		MessagesTransportKind = Selection.DefaultExchangeMessagesTransportKind;
	EndIf;
	
	Return MessagesTransportKind;
	
EndFunction
#EndRegion

#EndIf
